app/Http/Controllers/Home/DetailController.php

select * from `article` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `article`
---
    public function index()
    {
        //获取Article的数据

        $res = Article::orderBy("id",'desc')->paginate(15); //15条每页浏览

select * from `user` where `account` = '1@qq.com' limit 1
insert into `contents` (`userid`, `title`, `author`, `content`) values ('1', '55555555555', '5', '5')
insert into `article` (`title`, `author`, `cid`, `userid`) values ('55555555555', '5', '234', '1')
---
    public function store(Request $request)
    {
        //获取传过来的字段信息
        $info = $request->only('userid','title','author','content');

        //获取得到session里储存的登录信息
        $list =\DB::table('user')->where('account',session("User"))->first();
        //将session里获取的id赋给传过来的userid;
        $info['userid'] = $list->id;
       // echo "<pre>";
       // print_r($info);
        //向contents表里添加数据并获取表的id
        $id = \DB::table("contents")->insertGetId($info);
        //实例Article表
        $data = new Article;
        //获取传过来的标题，作者字段
        $info2 = $request->only('title','author');
        //让contents的id等于$info2里的 cid,字段，userid字段等于session里的id字段
        $info2['cid'] = $id;

        $info2['userid'] =$list->id;
        //$info2的数据添加到 Article
        $data->insert($info2);

select * from `contents` where `id` = '234' and `contents`.`id` = '234' limit 1
---
    public function edit($id)
    {

        //return $id;
        //获取要修改的单条信息
        $list = Contents::where('id',$id)->find($id); //获取信息

update `contents` set `title` = '7', `author` = '57', `content` = '77777777777777777' where `id` = '234'
update `article` set `title` = '7', `author` = '57' where `cid` = '234'
---
    public function update(Request $request,$id)
    {
        //dump( $id) ;die;
        //获取修改的信息
        $input = $request->only('title','author','content');
        //$data =new Contents;
        $data =Contents::where('id',$id)->update($input);

        $info = $request->only('title','author');
        $content = Article::where('cid',$id)->update($info);

delete from `article` where `cid` = '228'
delete from `contents` where `id` = '228'
---
    public function destroy(Request $request, $id)
    {
        //print_r($id);
        //获取传过来的$id等于Article里的cid然后执行删除
        Article::where('cid',$id)->delete();
        //获取传过来的$id等于Contents里的id执行删除
        Contents::where('id',$id)->delete();

select * from `article` where `status` = '1'
---
    public function through()
    {

        //echo 'aaaaa';
        $list =  Article::where('status',1)->get();

select * from `article` where `status` = '2'
---
    public function nothrough()
    {

        $list = Article::where('status',2)->get();

select * from `article` where `status` = '3'
---
    public function daithrough()
    {

        $list = Article::where('status',3)->get();