app/Http/Controllers/Admin/ArticleController.php

select * from `Article` order by `id` desc limit 5 offset 0
select count(*) as aggregate from `Article`
---
    public function index()
    {
        //
        $db = \DB::table("Article");

       //判断并封装搜索条件
       $params = array();
       if(!empty($_GET['author'])){
           $db->where("author","like","%{$_GET['author']}%");
           $params['author'] = $_GET['author']; //维持搜索条件
       }

       // $list = $db->get(); //获取全部
       $list = $db->orderBy("id",'desc')->paginate(5); //5条每页浏览

delete from `article` where `cid` = '230'
delete from `contents` where `id` = '230'
---
    public function destroy(Request $request, $id)
    {

        Article::where('cid',$id)->delete();
        Contents::where('id',$id)->delete();